# Introduction to Data Science 
# Laboratory - 02

    Introduction to Data Science

    Programming Exercise: 02

    Name: Tran Duc Trung

    Student ID: 21280115

# Exercise 1

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [4]:
drinks=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv")

### Step 4. Which continent drinks more beer on average?

In [5]:
aveBeer=sum(drinks.beer_servings)/len(drinks.beer_servings)
aveBeerContinent=drinks.groupby("continent").beer_servings.mean()
print("Average beer servings of world: ",aveBeer)
print("Continents drink more beer than average:\n",aveBeerContinent[aveBeerContinent>aveBeer])

Average beer servings of world:  106.16062176165804
Continents drink more beer than average:
 continent
EU    193.777778
SA    175.083333
Name: beer_servings, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [6]:
drinks.groupby("continent").wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [7]:
drinks.groupby("continent").total_litres_of_pure_alcohol.mean()

continent
AF    3.007547
AS    2.170455
EU    8.617778
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 7. Print the median alcohol consumption per continent for every column

In [8]:
drinks.groupby("continent").total_litres_of_pure_alcohol.median()

continent
AF     2.30
AS     1.20
EU    10.00
OC     1.75
SA     6.85
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [9]:
print("max values for spirit consumption: ",drinks.spirit_servings.max())
print("min values for spirit consumption: ",drinks.spirit_servings.min())
print("mean values for spirit consumption: ",drinks.spirit_servings.mean())

max values for spirit consumption:  438
min values for spirit consumption:  0
mean values for spirit consumption:  80.99481865284974

# Exercise 2

### Introduction:

### Step 1. Import the necessary libraries

In [10]:
import requests

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [11]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
f1 = requests.get(url)
rewriteTXT=f1.text.replace("|", ",")
f2=open("myfile.txt", "w")
f2.write(rewriteTXT)
f2.close()

users=pd.read_csv("myfile.txt")
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Step 4. Discover what is the mean age per occupation

In [12]:
users.groupby("occupation").age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [13]:
male_df = users[users['gender'] == 'M']
occupation_male_ratio=male_df.groupby("occupation")["gender"].count()/users.groupby("occupation")["gender"].count()
print(occupation_male_ratio.sort_values(ascending=False))

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [31]:
users.groupby("occupation").age.agg(["max","min"]).reset_index()

       occupation  max  min
0   administrator   70   21
1          artist   48   19
2          doctor   64   28
3        educator   63   23
4        engineer   70   22
5   entertainment   50   15
6       executive   69   22
7      healthcare   62   22
8       homemaker   50   20
9          lawyer   53   21
10      librarian   69   23
11      marketing   55   24
12           none   55   11
13          other   64   13
14     programmer   63   20
15        retired   73   51
16       salesman   66   18
17      scientist   55   23
18        student   42    7
19     technician   55   21
20         writer   60   18

### Step 7. For each combination of occupation and gender, calculate the mean age

In [32]:
users.groupby(["occupation","gender"]).age.mean().reset_index()

       occupation gender        age
0   administrator      F  40.638889
1   administrator      M  37.162791
2          artist      F  30.307692
3          artist      M  32.333333
4          doctor      M  43.571429
5        educator      F  39.115385
6        educator      M  43.101449
7        engineer      F  29.500000
8        engineer      M  36.600000
9   entertainment      F  31.000000
10  entertainment      M  29.000000
11      executive      F  44.000000
12      executive      M  38.172414
13     healthcare      F  39.818182
14     healthcare      M  45.400000
15      homemaker      F  34.166667
16      homemaker      M  23.000000
17         lawyer      F  39.500000
18         lawyer      M  36.200000
19      librarian      F  40.000000
20      librarian      M  40.000000
21      marketing      F  37.200000
22      marketing      M  37.875000
23           none      F  36.500000
24           none      M  18.600000
25          other      F  35.472222
26          other      M  34.028986
27     programmer      F  32.166667
28     programmer      M  33.216667
29        retired      F  70.000000
30        retired      M  62.538462
31       salesman      F  27.000000
32       salesman      M  38.555556
33      scientist      F  28.333333
34      scientist      M  36.321429
35        student      F  20.750000
36        student      M  22.669118
37     technician      F  38.000000
38     technician      M  32.961538
39         writer      F  37.631579
40         writer      M  35.346154

### Step 8.  For each occupation present the percentage of women and men

In [57]:
female=(users[users.gender=="F"].groupby("occupation").gender.count())/(users.groupby("occupation").gender.count())*100
male=(users[users.gender=="M"].groupby("occupation").gender.count())/(users.groupby("occupation").gender.count())*100
result = pd.concat([female, male], axis=1)
result.columns = ['% female', '% male']
result.reset_index(inplace=True)
print(result)

       occupation   % female      % male
0   administrator  45.569620   54.430380
1          artist  46.428571   53.571429
2          doctor        NaN  100.000000
3        educator  27.368421   72.631579
4        engineer   2.985075   97.014925
5   entertainment  11.111111   88.888889
6       executive   9.375000   90.625000
7      healthcare  68.750000   31.250000
8       homemaker  85.714286   14.285714
9          lawyer  16.666667   83.333333
10      librarian  56.862745   43.137255
11      marketing  38.461538   61.538462
12           none  44.444444   55.555556
13          other  34.285714   65.714286
14     programmer   9.090909   90.909091
15        retired   7.142857   92.857143
16       salesman  25.000000   75.000000
17      scientist   9.677419   90.322581
18        student  30.612245   69.387755
19     technician   3.703704   96.296296
20         writer  42.222222   57.777778

# Exercise 3

### Introduction:

### Step 1. Import the necessary libraries

### Step 2. Create the DataFrame with the following values:

In [15]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
            'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
            'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [59]:
regiment=pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [63]:
print("The mean preTestScore from the regiment Nighthawks: ",regiment[regiment.regiment=="Nighthawks"].preTestScore.mean())

The mean preTestScore from the regiment Nighthawks:  15.25

### Step 5. Present general statistics by company

In [66]:
regiment.company.describe()

count      12
unique      2
top       1st
freq        6
Name: company, dtype: object

### Step 6. What is the mean of each company's preTestScore?

In [67]:
regiment.groupby(["company"]).preTestScore.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [69]:
regiment.groupby(["company","regiment"]).preTestScore.mean().reset_index()

  company    regiment  preTestScore
0     1st    Dragoons           3.5
1     1st  Nighthawks          14.0
2     1st      Scouts           2.5
3     2nd    Dragoons          27.5
4     2nd  Nighthawks          16.5
5     2nd      Scouts           2.5

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [70]:
regiment.groupby(["company","regiment"]).preTestScore.mean()

company  regiment
1st      Dragoons       3.5
         Nighthawks    14.0
         Scouts         2.5
2nd      Dragoons      27.5
         Nighthawks    16.5
         Scouts         2.5
Name: preTestScore, dtype: float64

### Step 9. Group the entire dataframe by regiment and company

In [95]:
regim=regiment.groupby(["company","regiment"])

### Step 10. What is the number of observations in each regiment and company

In [94]:
regim.size()

company  regiment
1st      Dragoons      2
         Nighthawks    2
         Scouts        2
2nd      Dragoons      2
         Nighthawks    2
         Scouts        2
dtype: int64

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [103]:
for name,group in regim:
    print("Group: ",name)
    print(group)

Group:  ('1st', 'Dragoons')
   regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25
Group:  ('1st', 'Nighthawks')
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
Group:  ('1st', 'Scouts')
  regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70
Group:  ('2nd', 'Dragoons')
   regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Group:  ('2nd', 'Nighthawks')
     regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62
Group:  ('2nd', 'Scouts')
   regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70